# Pandas Breakout Questions

To get some hands on experience with `pandas` we will be working with the somewhat morose dataset looking at all the mass shooting events that occured in 2015 (`./data/mass_shootings_2015.csv`)

In [2]:
import pandas as pd

## 1. Reading in the Dataframe

First things first, we must read in our dataset!
Turn to your neighbor and figure out how to read this data into a Dataframe.  Once you have it read in, take a look at the columns and look at some summary statistics.

In [3]:
df = pd.read_csv('./data/mass_shootings_2015.csv')

In [10]:
df.head()

,Incident Date,State,City Or County,Address,# Killed,# Injured,Operations
0,"December 31, 2015",Louisiana,New Orleans,1900 block of Amelia Street,0,5,NaN
1,"December 27, 2015",Tennessee,Jackson,North Parkway,0,4,NaN
2,"December 26, 2015",Pennsylvania,Philadelphia,4210 Macalester St,0,4,NaN
3,"December 25, 2015",Florida,Jacksonville,Franklin and Odessa,0,4,NaN
4,"December 25, 2015",Alabama,Mobile,785 Schillinger Rd S,0,4,NaN

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 7 columns):
Incident Date     330 non-null object
State             330 non-null object
City Or County    330 non-null object
Address           327 non-null object
# Killed          330 non-null int64
# Injured         330 non-null int64
Operations        0 non-null float64
dtypes: float64(1), int64(2), object(4)
memory usage: 18.1+ KB

## 2. Clean Column Names

The first thing I always do when reading in a Datafram is clean up our column names!  Personally I view spaces, special characters, and capitals in column names as no-no's.  Granted this isn't a hard and fast rule but we have already seen cases where having spaces in column names causes issues.

With your neighbor, clean the columns names of this Dataframe!

In [23]:
cols = [i.lower().replace(' ','_').replace('#', 'num') for i in df.columns]
df.columns = cols

In [22]:
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,operations
0,"December 31, 2015",Louisiana,New Orleans,1900 block of Amelia Street,0,5,NaN
1,"December 27, 2015",Tennessee,Jackson,North Parkway,0,4,NaN
2,"December 26, 2015",Pennsylvania,Philadelphia,4210 Macalester St,0,4,NaN
3,"December 25, 2015",Florida,Jacksonville,Franklin and Odessa,0,4,NaN
4,"December 25, 2015",Alabama,Mobile,785 Schillinger Rd S,0,4,NaN

## 3. Cast the `date` column as a datetime object

We can see from our initial look at this data that the `date` column is actually an object (basically a string).  Let's alter this column to make it an actual date!

HINT: http://pandas.pydata.org/pandas-docs/stable/generated/pandas.to_datetime.html

In [30]:
df['incident_date'] = pd.to_datetime(df.iloc[:,0])
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,operations
0,2015-12-31,Louisiana,New Orleans,1900 block of Amelia Street,0,5,NaN
1,2015-12-27,Tennessee,Jackson,North Parkway,0,4,NaN
2,2015-12-26,Pennsylvania,Philadelphia,4210 Macalester St,0,4,NaN
3,2015-12-25,Florida,Jacksonville,Franklin and Odessa,0,4,NaN
4,2015-12-25,Alabama,Mobile,785 Schillinger Rd S,0,4,NaN

## 4. Make a new column `month`

Using that `date` column, create a new column called `month` that will have an `int` representing the ordinal month (e.g. `1` would indicate January)

HINT: Try pulling out a single date (use `.loc` for practice!) and extract the month.  Then try using the `.map` function to create a new column

In [33]:
date = df.iloc[0,0]
date.month

12

In [36]:
df['month'] = df.iloc[:,0].map(lambda x: x.month)
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,operations,month
0,2015-12-31,Louisiana,New Orleans,1900 block of Amelia Street,0,5,NaN,12
1,2015-12-27,Tennessee,Jackson,North Parkway,0,4,NaN,12
2,2015-12-26,Pennsylvania,Philadelphia,4210 Macalester St,0,4,NaN,12
3,2015-12-25,Florida,Jacksonville,Franklin and Odessa,0,4,NaN,12
4,2015-12-25,Alabama,Mobile,785 Schillinger Rd S,0,4,NaN,12

## 5. Drop the `operations` column

It looks like the operations column doesn't actually contain any useful information so let's drop that!

In [46]:
df.drop('operations', axis=1, inplace=TRUE')

SyntaxError: EOL while scanning string literal (<ipython-input-46-2591e45daefb>, line 1)

In [39]:
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,month
0,2015-12-31,Louisiana,New Orleans,1900 block of Amelia Street,0,5,12
1,2015-12-27,Tennessee,Jackson,North Parkway,0,4,12
2,2015-12-26,Pennsylvania,Philadelphia,4210 Macalester St,0,4,12
3,2015-12-25,Florida,Jacksonville,Franklin and Odessa,0,4,12
4,2015-12-25,Alabama,Mobile,785 Schillinger Rd S,0,4,12

## 6. How many incidents occured in each Month?

Let's look at how many incidents took place in each month.
HINT: (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html)

In [48]:
gb = df.groupby('month')
gb.count()

       incident_date  state  city_or_county  address  num_killed  num_injured
month
1                 23     23              23       23          23           23
2                 16     16              16       16          16           16
3                 20     20              20       20          20           20
4                 19     19              19       19          19           19
5                 35     35              35       35          35           35
6                 36     36              36       34          36           36
7                 41     41              41       41          41           41
8                 39     39              39       39          39           39
9                 34     34              34       33          34           34
10                20     20              20       20          20           20
11                27     27              27       27          27           27
12                20     20              20       20          20           20

## 7. How many casualties occured in each Month?

Right now we have the number of people involved broken out into the number killed and the number injured.  Let's create a single column that indicates the number of casualties (i.e. the sum of killed and injured)

In [64]:
df['num_involved'] = df['num_killed'] + df['num_injured']

In [65]:
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,month,num_involved
0,2015-12-31,Louisiana,New Orleans,1900 block of Amelia Street,0,5,12,5
1,2015-12-27,Tennessee,Jackson,North Parkway,0,4,12,4
2,2015-12-26,Pennsylvania,Philadelphia,4210 Macalester St,0,4,12,4
3,2015-12-25,Florida,Jacksonville,Franklin and Odessa,0,4,12,4
4,2015-12-25,Alabama,Mobile,785 Schillinger Rd S,0,4,12,4

## 8. How many casualties occured by State?

Now that we have a casualties column, let's brake down the number of casualties by state.

In [52]:
df.groupby('state').count()['num_killed']

state
Alabama                  4
Arizona                  6
Arkansas                 2
California              28
Colorado                 3
Connecticut              2
Delaware                 1
District of Columbia     2
Florida                 24
Georgia                 20
Illinois                25
Indiana                 10
Iowa                     2
Kansas                   1
Kentucky                 4
Louisiana               14
Maryland                13
Massachusetts            5
Michigan                10
Minnesota                5
Mississippi              2
Missouri                11
Montana                  1
Nebraska                 3
Nevada                   1
New Jersey               9
New Mexico               2
New York                21
North Carolina          12
Ohio                    13
Oklahoma                 4
Oregon                   2
Pennsylvania            15
Rhode Island             1
South Carolina          11
South Dakota             1
Tennessee               11
Texas                   19
Vermont                  1
Virginia                 5
Washington               1
Wisconsin                3
Name: num_killed, dtype: int64

## 9. How many distinct City or Counties are represented?

Let's see how many distinct City or Counties are represented in this dataset.

In [55]:
len(df['city_or_county'].unique())

205

## 10. INDEXING!

You should be using `.loc`, `.iloc`, or `.ix` for all of these questions!

1. Return all rows occuring in Alabama
2. Return all shootings with more than 5 people killed
3. Return the address of shootings occuring on or after November 1st
4. Return the address and date of all shootings occuring in Louisiana or Florida with the casualty counts ranging from 6 to 10 (inclusive)

In [72]:
df.loc[df['state'] == 'Alabama']

,incident_date,state,city_or_county,address,num_killed,num_injured,month,num_involved
4,2015-12-25,Alabama,Mobile,785 Schillinger Rd S,0,4,12,4
35,2015-11-16,Alabama,Cherokee (county),1400 block of County Road 664,3,1,11,4
229,2015-05-24,Alabama,Montgomery,Smiley Court,1,3,5,4
259,2015-04-18,Alabama,Montgomery,1800 block of Gibbs Court,0,5,4,5

In [73]:
df.loc[df['num_killed'] > 5]

,incident_date,state,city_or_county,address,num_killed,num_injured,month,num_involved
18,2015-12-02,California,San Bernardino,1365 South Waterman Avenue,16,19,12,35
66,2015-10-01,Oregon,Roseburg,1140 Umpqua College Rd,10,9,10,19
83,2015-09-17,South Dakota,Platte,36705 379th Street,6,0,9,6
128,2015-08-08,Texas,Houston,2211 Falling Oaks,8,0,8,8
159,2015-07-16,Tennessee,Chattanooga,4051 Amnicola Highway,6,2,7,8
195,2015-06-17,South Carolina,Charleston,110 Calhoun Street,9,0,6,9
235,2015-05-17,Texas,Waco,4671 S Jack Kultgen Expy,9,18,5,27
292,2015-02-26,Missouri,Tyrone,18279 Highway H,8,1,2,9

In [75]:
df.loc[df['incident_date'] > '2015-11-01', 'address']

0                           1900 block of Amelia Street
1                                         North Parkway
2                                    4210 Macalester St
3                                   Franklin and Odessa
4                                  785 Schillinger Rd S
5                       14600 block of East 14th Street
6                                11th and Castle Street
7                          21630 Southwest 120th Avenue
8     Northeast Seventh Avenue and Northeast 166th S...
9                                      307 Jefferson St
10                                5550 S. Flower Street
11                          17000 block of Keelson Lane
12                                      Whitaker Street
13                    5100 block of Park Heights Avenue
14                       200 Block of  Brownsville Road
15                       2300 block of Baltimore Avenue
16                                        Market Street
17                 North 108th Street and Military Road
18                           1365 South Waterman Avenue
19                        100 block of West 33rd Street
20                                      648 E. Court St
21                                 3480 Centennial Blvd
22                            7900 block of Florin Road
23                                  1321 Colletta Court
24                        90 block of S. Terrace Avenue
25                                  Morgan Avenue North
26                                 1800 Block of FM 802
27                                    Broadway and Pike
28                         1900 block of Gallier Street
29                                         203 Broadway
30                                          Park Circle
31                         4100 block of West Roosevelt
32                                  Stricker and School
33                                       Prospect Drive
34    California Avenue and Martin Luther King Jr. B...
35                        1400 block of County Road 664
36                        800 Block of County Road 2217
37                       5600 block of Blakemore Street
38                                         1159 Main St
39               1300 block of South Shirley Oaks Drive
40                       400 block of North Beville Ave
41                                    13859 8 Mile Road
42                                    4397 NW 6th Drive
43                                   Bayaud and Bannock
44                            1000 block of Feliz Drive
45                           Ella Street and Kings Road
46                                     2217 Refuge Road
Name: address, dtype: object

In [80]:
df.loc[(df['state'].isin(['Florida', 'Alabama'])) & (df['num_involved'] >= 6) & (df['num_involved'] <= 10), ['address', 'incident_date']]

                    address incident_date
86   1910 South Pine Avenue    2015-09-13
271       5312 Thomas Drive    2015-03-27

In [83]:
df.loc(172, ['address', 'incident_date'])

TypeError: __call__() takes at most 2 arguments (3 given)

## 11. Sort by Date and reset index

Let's reorder our Dataframe based on the date and reset our index to reflect this.

NOTE: Don't use `df.sort()` as this method is deprecated!  Instead you should be using `df.sort_values()`

In [88]:
df.sort_values(by='incident_date', inplace=True)

In [93]:
df.reset_index(drop=True, inplace=True)

In [97]:
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,month,num_involved
0,2015-01-01,Tennessee,Memphis,Interstate 240 and Poplar Avenue,0,5,1,5
1,2015-01-02,Georgia,Savannah,500 block of W. 54th Street,1,4,1,5
2,2015-01-04,Virginia,Roanoke,3634 Shenandoah Ave NW,2,4,1,6
3,2015-01-04,Texas,Dallas,2000 block of Ben Hur St.,3,1,1,4
4,2015-01-06,Florida,Miami,1300 block of NW 62nd Street,1,3,1,4

## EXTRA CREDIT:  Create a graph showing the weekly frequency of shootings
HINT: Set the index as the date and refer to http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.resample.html

In [98]:
df.set_index('incident_date')
df.head()

,incident_date,state,city_or_county,address,num_killed,num_injured,month,num_involved
0,2015-01-01,Tennessee,Memphis,Interstate 240 and Poplar Avenue,0,5,1,5
1,2015-01-02,Georgia,Savannah,500 block of W. 54th Street,1,4,1,5
2,2015-01-04,Virginia,Roanoke,3634 Shenandoah Ave NW,2,4,1,6
3,2015-01-04,Texas,Dallas,2000 block of Ben Hur St.,3,1,1,4
4,2015-01-06,Florida,Miami,1300 block of NW 62nd Street,1,3,1,4